/**
 * 
 */

/* 鼠标特效 */
var a_idx = 0;
jQuery(document).ready(function($) {
    $("body").click(function(e) {
        //var a = new Array("富强", "民主", "文明", "和谐", "自由", "平等", "公正" ,"法治", "爱国", "敬业", "诚信", "友善");
    	var a = new Array("正义,那些冠冕堂皇之词", 
    					  "人的一生有三件必经之事:荣耀,死亡和杀戮 ", 
    					  "华洛,狠狠地啄",
    					  "仁义道德,也是一种奢侈",
    					  "千军万马一将在,探囊取物有何难",
    					  "落叶的一生,只是为了归根么",
    					  "且听风吟,御剑于心",
    					  "放马过来吧",
    					  "你会死的很光荣的",
    					  "即使一无所有,也要未雨绸缪",
    					  "我们不受岁月左右",
    					  "想要再来一发吗,我可不会留下任何悬念",
    					  "体型并不能说明一切",
    					  "规则就是用来打破的",
    					  "这个故事还没有完结",
    					  "我宁愿犯错误,也不愿什么都不做",
    					  "断剑重铸之日,骑士归来之时",
    					  "只有蠢货才会犹豫不决",
    					  "一个能打的都没有",
    					  "你有一双摄人心魄的眼睛",
    					  "命运已做出了它的选择",
    					  "你们知道最强的武器是什么",
    					  "哪一个比较沉重,你的剑刃,还是你的过去?",
    					  "吾之荣耀,离别已久",
    					  "死亡如风,常伴吾身",
    					  "集中起来的意志,可以击穿顽石",
    					  "生命不息,战斗不止",
    					  "陷阵之志,有死无生",
    					  "荣耀剑下取,均衡乱中求",
    					  "生与死轮回不止,我们生,他们死",
    					  "世间万物皆系于一箭之上",
    					  "明日安在,无人能云",
    					  "且随疾风前行,身后亦需留心",
    					  "长路漫漫,唯剑作伴",
    					  "人在塔在", 
    					  "破碎的剑刃,破碎的意志", 
    					  "犯我德邦者,虽远必诛", 
    					  "如果暴力不是为了杀戮,那将毫无意义", 
    					  "荣誉驱使着我", 
    					  "懦弱之举,我决不姑息", 
    					  "我的剑,比什么都重要", 
    					  "胜利在呼唤", 
    					  "没人能质疑我们的决心", 
    					  "他们将会知道什么是战争", 
    					  "无罪之人,方可安睡", 
    					  "吾之初心,永世难忘",
    					  "你们会输的",  
    					  "哪里需要我呢", 
    					  "他们心跳加快", 
    					  "我去前面探探路", 
    					  "狡诈恶徒", 
    					  "一点寒芒先到,随后枪出如龙",
    					  "我会偿还的");
        var $i = $("<span />").text(a[a_idx]);
        a_idx = (a_idx + 1) % a.length;
        var x = e.pageX,
        y = e.pageY;
        $i.css({
            "z-index": 99999999999999999999999999,
            "top": y - 20,
            "left": x,
            "position": "absolute",
            "font-weight": "bold",
            "color": "#FF0000"
        });
        $("body").append($i);
        $i.animate({
            "top": y - 180,
            "opacity": 0
        },
        1500,
        function() {
            $i.remove();
        });
    });
});
